Repository: BenfekhadouMeriem/flutter_anglais
Catalog: lib/l10n/app_*.arb
Languages: fr

# continueListening
source: Would you like to continue listening?
fr: Voulez-vous continuer à écouter ?

# continueText
source: Continue
fr: Continuer

source: Exit
fr: Quitter

# audioError
source: Audio loading error
fr: Erreur de chargement audio

# speechInitFailed
source: Failed to initialize speech recognition
fr: Échec de l'initialisation de la reconnaissance vocale

# initError
source: Initialization error
fr: Erreur d'initialisation

source: Status
fr: Statut

source: restarting
fr: redémarrage

source: Error
fr: Erreur

# grantMicAccess
source: Please grant microphone access
fr: Veuillez autoriser l'accès au microphone

# speechStopped
source: Speech stopped due to silence, restarting...
fr: Parole arrêtée en raison du silence, redémarrage...

source: Network issue
fr: Problème de réseau

# speechNotInitialized
source: Speech recognition not initialized
fr: Reconnaissance vocale non initialisée

# micPermissionDenied
source: Microphone permission denied
fr: Autorisation du microphone refusée

# noInternet
source: No internet connection
fr: Pas de connexion Internet

source: Speak now...
fr: Parlez maintenant...

source: Keep speaking...
fr: Continuez à parler...

source: Listening error
fr: Erreur d'écoute

# retryFailed
source: Retry
fr: Échec de la nouvelle tentative

source: failed
fr: échoué

# restartListeningFailed
source: Failed to restart listening after {maxRetries} attempts
fr: Échec du redémarrage de l'écoute après {maxRetries} tentatives

# listeningStopped
source: Listening stopped. Analyzing...
fr: Écoute arrêtée. Analyse...

source: No text detected
fr: Aucun texte détecté

source: Speak louder
fr: Parlez plus fort

# noTranscription
source: No transcription available
fr: Aucune transcription disponible

source: Excellent pronunciation!
fr: Excellente prononciation !

source: Good pronunciation
fr: Bonne prononciation

# needsImprovement
source: Pronunciation needs improvement
fr: La prononciation doit être améliorée

source: You said
fr: Vous avez dit

source: Correct words
fr: Mots corrects

source: Dark Mode
fr: Mode sombre

source: Reading Mode
fr: Mode lecture

source: Exit Reading Mode
fr: Quitter le mode lecture

source: Increase Text Size
fr: Augmenter la taille du texte

source: Decrease Text Size
fr: Diminuer la taille du texte

source: Pronunciation Tips
fr: Conseils de prononciation

# speakClearly
source: Speak clearly at a natural pace
fr: Parlez clairement à un rythme naturel

# micDistance
source: Hold phone 15-20 cm from mouth
fr: Tenez le téléphone à 15-20 cm de la bouche

# avoidNoise
source: Avoid background noise
fr: Évitez les bruits de fond

# practiceWords
source: Practice difficult words separately
fr: Pratiquez les mots difficiles séparément

# focusIntonation
source: Focus on word stress and intonation
fr: Concentrez-vous sur l'accentuation et l'intonation

source: Speed
fr: Vitesse

source: Good Job
fr: Bon travail

source: Needs Work
fr: À améliorer

source: Accuracy
fr: Précision

source: Incorrect words
fr: Mots incorrects

# noEvaluation
source: No pronunciation evaluation yet
fr: Aucune évaluation de prononciation pour le moment

source: Rewind
fr: Rembobiner

source: Play
fr: Jouer

source: Forward
fr: Avancer

source: Stop
fr: Arrêter

source: Speak
fr: Parler

# speedChangeError
source: Playback speed change error
fr: Erreur de changement de vitesse de lecture
